#+TITLE: Tarea1
#+SUBTITLE: IIS447 - Comunicación De Datos \\
#+SUBTITLE: Universidad de La Frontera
#+DATE: Viernes 12 de noviembre de 2021
#+AUTHOR: Manuel Fuica Morales \\
#+AUTHOR: Matrícula: 18 959 392 9 19 \\
#+AUTHOR: Estudiante de Ingeniería Civil Industrial mención Informática \\
#+AUTHOR: [[mailto:m.fuica01@ufromail.cl][m.fuica01@ufromail.cl]]
#+OPTIONS: toc:nil
#+LANGUAGE: es
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [a4paper,12pt]
#+LATEX_HEADER: \usepackage[spanish]{babel}
#+LATEX_HEADER: \usepackage{enumerate}
#+LATEX_HEADER:\usepackage{tcolorbox}

**** Contexto

| /  |         |            |            | >          |         |         |         |              |                |         |         |         |                 |
|    |         |            |            |            |   <c>   |   <c>   |   <c>   |     <c>      |      <c>       |   <c>   |   <c>   |   <c>   |       <c>       |
| IP | decimal |        255 |        255 | 255        |    0    |         |         |              | \(\downarrow\) |         |         |         |                 |
|----+---------+------------+------------+------------+---------+---------+---------+--------------+----------------+---------+---------+---------+-----------------|
|    | binario | \(\cdots\) | \(\cdots\) | \(\cdots\) | \(2^8\) | \(2^7\) | \(2^6\) |   \(2^5\)    |    \(2^4\)     | \(2^3\) | \(2^2\) | \(2^1\) |  nro de Hosts   |
|    |         |            |            |            | \(2^1\) | \(2^2\) | \(2^3\) |   \(2^4\)    |    \(2^5\)     | \(2^6\) | \(2^7\) | \(2^8\) | nro de Subredes |
|    |         |            |            |            |   128   |   64    |   32    |      16      |       8        |    4    |    2    |    1    |                 |
|    |         |            |            |            |    1    |    1    |    1    |      1       |       0        |    0    |    0    |    0    |  bits tomados   |
|    |         |            |            |            |         |         |         | \(\uparrow\) |                |         |         |         |                 |

Nos especifican /14/ hosts y /14/ subredes
\(\rightarrow\) \(2^4-2=16-2 \geq 14\)

# Por lo tanto, el número de subredes será \(128+64+32+ = 224 \)
La sumatoria nos queda de la forma:
\(\sum (128, 64, 32, 16) = 240\)

#+begin_src emacs-lisp :exports none :results replace
(+ 128 64 32 16)
#+end_src

#+RESULTS:
: 240

**** Contexto
| /  |         |            |            | >          |         |         |              |                |         |         |         |         |                 |
|    |         |            |            |            |   <c>   |   <c>   |     <c>      |      <c>       |   <c>   |   <c>   |   <c>   |   <c>   |       <c>       |
| IP | decimal |        255 |        255 | 255        |    0    |         |              | \(\downarrow\) |         |         |         |         |                 |
|----+---------+------------+------------+------------+---------+---------+--------------+----------------+---------+---------+---------+---------+-----------------|
|    | binario | \(\cdots\) | \(\cdots\) | \(\cdots\) | \(2^8\) | \(2^7\) |   \(2^6\)    |    \(2^5\)     | \(2^4\) | \(2^3\) | \(2^2\) | \(2^1\) |  nro de Hosts   |
|    |         |            |            |            | \(2^1\) | \(2^2\) |   \(2^3\)    |    \(2^4\)     | \(2^5\) | \(2^6\) | \(2^7\) | \(2^8\) | nro de Subredes |
|    |         |            |            |            |   128   |   64    |      32      |       16       |    8    |    4    |    2    |    1    |                 |
|    |         |            |            |            |    1    |    1    |      1       |       0        |    0    |    0    |    0    |    0    |  bits tomados   |
|    |         |            |            |            |         |         | \(\uparrow\) |                |         |         |         |         |                 |

Nos especifican /30/ hosts y /6/ subredes
#+begin_src emacs-lisp :exports none :results replace
(expt 2 5)
#+end_src

#+RESULTS:
: 32

\(\rightarrow\) \(2^5-2=32-2 \geq 30\)

La sumatoria nos queda de la forma:
\(\sum (128, 64, 32) = 224\)

#+begin_src emacs-lisp :exports none :results replace
(+ 128 64 32)
#+end_src

#+RESULTS:
: 224

**** Contexto
| /  |         |            |            | >          |         |         |              |                |         |         |         |         |                 |
|    |         |            |            |            |   <c>   |   <c>   |     <c>      |      <c>       |   <c>   |   <c>   |   <c>   |   <c>   |       <c>       |
| IP | decimal |        255 |        255 | 255        |    0    |         |              | \(\downarrow\) |         |         |         |         |                 |
|----+---------+------------+------------+------------+---------+---------+--------------+----------------+---------+---------+---------+---------+-----------------|
|    | binario | \(\cdots\) | \(\cdots\) | \(\cdots\) | \(2^8\) | \(2^7\) |   \(2^6\)    |    \(2^5\)     | \(2^4\) | \(2^3\) | \(2^2\) | \(2^1\) |  nro de Hosts   |
|    |         |            |            |            | \(2^1\) | \(2^2\) |   \(2^3\)    |    \(2^4\)     | \(2^5\) | \(2^6\) | \(2^7\) | \(2^8\) | nro de Subredes |
|    |         |            |            |            |   128   |   64    |      32      |       16       |    8    |    4    |    2    |    1    |                 |
|    |         |            |            |            |    1    |    1    |      1       |       0        |    0    |    0    |    0    |    0    |  bits tomados   |
|    |         |            |            |            |         |         | \(\uparrow\) |                |         |         |         |         |                 |

Nos especifican /30/ hosts y /6/ subredes
#+begin_src emacs-lisp :exports none :results replace
(expt 2 5)
#+end_src

#+RESULTS:
: 32

\(\rightarrow\) \(2^5-2=32-2 \geq 30\)

La sumatoria nos queda de la forma:
\(\sum (128, 64, 32) = 224\)

#+begin_src emacs-lisp :exports none :results replace
(+ 128 64 32)
#+end_src

#+RESULTS:
: 224

